Autodesk.Revit.DB.BuiltInFailures.ImportFailures.WorksetCreatedForLinkWarning
Newly created link types and instances were placed in new workset [workset name]

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.TooManyPickFaces
Too many faces were created from imported meshes. Host by Face tools may not select the imported meshes correctly.
Decrease the complexity of the file or try importing only selected layers to resolve.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.TextNotImported
Text is only imported if the "Current View Only" option is selected. To see the text in the original file, import again with this check box selected in the Import Dialog.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.SomeObjectsNotExploded
Import contained some 3D data or points which can't be exploded.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.LostAcisObjectsOnImport
Some ACIS objects could not be imported. To import them, use AutoCAD to convert them into polymesh objects and reimport.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportTooManyElmentsToExplode
Import Instance has [Number] elements. Imports with more than 10,000 elements cannot be exploded.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportTooFarAway
Imported objects located a large distance from the model might not display properly.  The 'Center-to-Center' option will be used.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportModelTooLarge
The imported model is too large.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportModelOutOfRange
The imported model is out of range.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCGenericRevitImportWarning
Revit had the following problems importing the IFC file: [Description]

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCGenericImportWarning
The following problems were encountered in the IFC file: [Description]

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCCantUpdateLinkedFile
The cached version of this IFC file is already loaded into another document in this session, and can't be updated.  To update the IFC file, please close all other documents containing the link, and then update.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.FailedToSetWorkplane
Could not set Work Plane of [Import].\n\nPlease use the Work Plane tool to set a Work Plane for this view.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.CannotRelinkWrapper
[Description]

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.CannotImportFile
Can't import file.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.CannotExplodeElement
Can't explode the imported object.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.CannotChangeImportSymbol
Can't change an imported or linked element's symbol type.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.BadFaceFoundInDwg
One or more hatch regions were found in the imported file with unconnected boundaries.  These hatch regions will be ignored.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures
Failures about ImportFailures.